Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: མཆོག་ཏུ་དགའ་བས་ལུས་དང་སེམས་ཤིན་ཏུ་སྦྱངས་པར་འགྱུར་རོ། །ལུས་དང་སེམས་ཤིན་ཏུ་སྦྱངས་པས་བདེ་སྟེ་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: Through their supreme joy they become physically and mentally pliable, and they reach a stage of bliss through that physical and mental pliancy and attain samādhi.

source: ཡིད་མཉམ་པར་བཞག་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་ཡིན་ནོ། །
en: Resting in meditative composure they see everything exactly as it is.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ་སྙམ་མོ། །
en: Bodhisattvas who see everything exactly as it is act with great compassion for beings.’

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་འདི་དང་། ཆོས་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་བསྒྲུབ་པར་བྱའོ་སྙམ་མོ། །
en: “A bodhisattva also thinks, ‘For the sake of all beings I should accomplish this gateway of samādhi and be able to see phenomena exactly as they are.

source: དེ་སྙིང་རྗེ་ཆེན་པོ་དེས་བསྐུལ་བས་ལྷག་པའི་ཚུལ་ཁྲིམས་དང་། ལྷག་པའི་སེམས་དང་། ལྷག་པའི་ཤེས་རབ་ལ་བསླབ་པ་ཡོངས་སུ་རྫོགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: Motivated with that kind of great compassion, one perfects the trainings of higher discipline, higher intention, and higher insight, and then awakens to unsurpassable, completely perfect awakening.

source: དེ་བས་ན་བདག་གིས་ཀྱང་ཚུལ་ཁྲིམས་ལ་གནས་པ་མི་བསྐྱོད་པ་མི་ལྷོད་པར་བྱའོ། །
en: Therefore I too will be unshakeable and steady in maintaining discipline.

source: སེམས་ཅན་ཐམས་ཅད་མངོན་དུ་བྱས་ནས་ཚུལ་ཁྲིམས་བསྲུང་བར་བྱའོ་སྙམ་མོ། །
en: I will guard my discipline with all beings in mind.’

source: བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་གནས་ལ་མི་གནས་པ་མ་ཡིན་ནོ། །
en: The discipline of bodhisattvas benefits all beings and is a support for happiness. It does not fail as a support for it.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་འབྱུང་བའི་ཚུལ་ཁྲིམས་ནི་གནོད་སེམས་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: “Furthermore, a bodhisattva thinks, ‘A bodhisattva’s discipline of leaving home brings about the perfection of a mind without harmful intent.

source: བྱང་ཆུབ་སེམས་དཔའི་རབ་ཏུ་བྱུང་བའི་ཚུལ་ཁྲིམས་ནི་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline as a renunciant perfects the abandonment of all possessions.

source: བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་དང་སྡོམ་པ་ཡང་དག་པར་འཛིན་པའི་ཚུལ་ཁྲིམས་ནི་ལུས་དང་། ངག་དང་། སེམས་ཡོངས་སུ་དག་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of maintaining their trainings and vows perfects purity in body, speech, and mind.

source: བྱང་ཆུབ་སེམས་དཔའི་ངེས་པར་སེམས་པའི་ཚུལ་ཁྲིམས་ནི་མངོན་པར་ཤེས་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of contemplation perfects the six higher cognitions.

source: བྱང་ཆུབ་སེམས་དཔའི་ནང་དུ་ཡང་དག་འཇོག་པའི་ཚུལ་ཁྲིམས་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of settling internally perfects the factors of awakening.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉན་པའི་ཚུལ་ཁྲིམས་ནི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of listening to the Dharma perfects the four correct discernments.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐོས་པ་ཡོངས་སུ་ཚོལ་བའི་ཚུལ་ཁྲིམས་ནི་ང་རྒྱལ་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of seeking learning perfects the absence of pride.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་བཀུར་བྱེད་པའི་ཚུལ་ཁྲིམས་ནི་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་ཆུད་མི་ཟ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of serving a spiritual friend perfects the indestructibility of their virtuous qualities.

source: བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་ཁྲིམས་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of the perfections perfects omniscient wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་སྟོན་པའི་ཚུལ་ཁྲིམས་ནི་ཆོས་སྨྲ་བ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of teaching the Dharma just as they heard it perfects their status as a Dharma reciter.

source: བྱང་ཆུབ་སེམས་དཔའི་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་སེམས་པའི་ཚུལ་ཁྲིམས་ནི་གཟུངས་དང་སྤོབས་པ་ཐོབ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of reflecting on the Dharma just as they heard it perfects their dhāraṇī and confident eloquence.

source: བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཚུལ་ཁྲིམས་ནི་སྐྱེ་བ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of the mind set on awakening perfects their transcendence of all births.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པའི་ཚུལ་ཁྲིམས་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཆུད་མི་ཟ་བར་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva’s discipline of not feeling hostile toward any being perfects the indestructibility of the mind set on awakening.

source: བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་སེམས་ཆུད་མི་ཟ་བའི་ཚུལ་ཁྲིམས་ནི་དཀོན་མཆོག་གསུམ་ཆུད་མི་ཟ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ་སྙམ་མོ། །
en: A bodhisattva’s discipline of the indestructible mind set on awakening perfects the indestructibility of the Three Jewels.’

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། ཚུལ་ཁྲིམས་བསྲུངས་པས་བསྲུངས་པ་ཐམས་ཅད་བསྲུངས་པ་ཡིན་ནོ་སྙམ་པ་འདི་ནི་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: They also think, ‘Those who have guarded their discipline have guarded all that needs guarding.’ “This, child of good family, is what is known as a bodhisattva’s application of the mindfulness of recollecting discipline.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་གཏོང་བ་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s application of the mindfulness of recollecting giving?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཅི་གཏོང་བ་དེ་ཐམས་ཅད་ནི་འདི་ལྟ་སྟེ་ཟང་ཟིང་གི་གཏོང་བ་དང་། ཆོས་ཀྱི་གཏོང་བ་དང་། གཏོང་བ་རྣམ་པ་གཉིས་ཀྱི་ནང་དུ་འདུས་སོ་སྙམ་མོ། །
en: A bodhisattva thinks, ‘All that can be given is included in the two types of giving: giving material goods and giving the Dharma.’

source: དེ་ལ་ཟང་ཟིང་གི་གཏོང་བས་ནི་བྱང་ཆུབ་སེམས་དཔའི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་སྐོང་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་རྣམ་པར་དག་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: By giving material goods, bodhisattvas perfect the purity that completes the major and minor marks, purify buddhafields, and ripen beings.

source: ཆོས་ཀྱི་གཏོང་བས་ནི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: By the giving of Dharma, bodhisattvas perfect the ten strengths, the four kinds of fearlessness, and the eighteen unique qualities of a buddha.

source: བག་ཆགས་ཀྱང་ཡང་དག་པར་འཇོམས་པར་བྱེད་དོ། །
en: Habitual patterns are also destroyed.

source: གཞན་ཡང་ཟང་ཟིང་གི་གཏོང་བས་ནི་ཕུང་པོ་ཐམས་ཅད་ངེས་པར་འདོར་བར་བྱེད་དོ། །
en: “By giving material goods bodhisattvas reject all the aggregates.

source: ཆོས་ཀྱི་གཏོང་བས་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ལས་ཡང་དག་པར་འདའོ། །
en: By giving the Dharma they surpass the state of all the śrāvakas and pratyekabuddhas.

source: གཞན་ཡང་ཟང་ཟིང་གི་གཏོང་བས་ནི་སྐྱེ་བའི་ལུས་ཡོངས་སུ་སྦྱོང་བར་བྱེད་དོ། །
en: By giving material goods bodhisattvas purify their birth body.

source: ཆོས་ཀྱི་གཏོང་བས་ནི་ཆོས་ཀྱི་སྐུར་ཡོངས་སུ་སྦྱོང་བར་བྱེད་དོ། །
en: By giving the Dharma they purify the dharmakāya.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཟང་ཟིང་གི་གཏོང་བས་ནི་ཕ་མ་ལས་བྱུང་བའི་སྟོབས་སྒྲུབ་པར་བྱེད་དེ།
en: “Child of good family, by giving material goods bodhisattva great beings perfect the strength imparted by their mother and father.

source: སྟོབས་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དང་། ས་བཅུ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མ་གཏོགས་པར་སུ་ལ་ཡང་མེད་དོ། །
en: No one else possesses that strength, apart from the thus-gone ones and bodhisattvas on the tenth bodhisattva level.

source: ཆོས་ཀྱི་གཏོང་བས་ནི་རྫུ་འཕྲུལ་གྱི་སྟོབས་སྒྲུབ་པར་བྱེད་དེ།
en: By giving the Dharma they achieve the strength of miraculous power.

source: གཞན་ཡང་ཟང་ཟིང་གི་གཏོང་བས་ནི་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: “Giving material goods brings about ripening.

source: ཆོས་ཀྱི་གཏོང་བས་ནི་རྣམ་པར་ཐར་བར་བྱེད་དོ། །
en: Giving the Dharma brings about release.

source: གཞན་ཡང་ཟང་ཟིང་གི་གཏོང་བས་ནི་ཚོགས་སོགས་སོ། །
en: Giving material goods gathers the requisites.

source: ཆོས་ཀྱི་གཏོང་བས་ནི་སྒྲོལ་ལོ། །
en: Giving the Dharma brings liberation.

source: གཞན་ཡང་ཟང་ཟིང་གི་གཏོང་བས་ནི་ནོར་ཡོངས་སུ་གཏོང་ངོ་། །
en: By giving material goods bodhisattvas give up wealth.

source: ཆོས་ཀྱི་གཏོང་བས་ནི་ཐམས་ཅད་གཏོང་ངོ་། །
en: By giving the Dharma, they give up everything.

source: གཞན་ཡང་ཟང་ཟིང་གི་གཏོང་བས་ནི་ཉོན་མོངས་པའི་སྒྲིབ་པ་ལས་རྣམ་པར་གྲོལ་བ་སྒྲུབ་པར་བྱེད་དོ། །
en: By giving material goods bodhisattvas effect liberation from the obscurations of the afflictive emotions.

source: ཆོས་ཀྱི་གཏོང་བས་ནི་ཤེས་བྱའི་སྒྲིབ་པ་ལས་རྣམ་པར་གྲོལ་བ་སྒྲུབ་པར་བྱེད་དོ། །
en: By giving the Dharma, they effect liberation from cognitive obscurations.

source: གཞན་ཡང་གཏོང་བ་གཏོང་བ་ཞེས་བྱ་བ་འདི་ནི་ཡོངས་སུ་རྟོག་པ་གཏོང་བའི་ཚིག་བླ་དགས་སོ། །
en: “Another way giving is defined as ‘giving’ is in terms of giving up conceptual designations.

source: འདི་ལྟ་སྟེ་ཡོངས་སུ་རྟོག་པ་གཏོང་བ་དེ་ནི་གཏོང་བ་རྣམས་ཀྱི་དམ་པའོ། །
en: That is to say, this mode of giving is supreme among all modes of giving.

source: ཡོངས་སུ་རྟོག་པ་བཏང་བས་བྱང་ཆུབ་སེམས་དཔའ་དག་པ་ཞེས་བྱའོ། །
en: By giving up conceptual designations one is known as an authentic bodhisattva.”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཡོངས་སུ་རྟོག་པ་ཞེས་བྱ་བ་འདི་གང་གི་ཚིག་བླ་དགས་སྨྲས་པ།
en: Mativikrama then asked, “Child of good family, what does conceptual designation refer to?”

source: རིགས་ཀྱི་བུ་ཡོངས་སུ་རྟོག་པ་ཞེས་བྱ་བ་འདི་ནི་ཡང་དག་པ་མ་ཡིན་ཞིང་མེད་པ་ལས་སྒྲོ་བཏགས་པའི་ཚིག་བླ་དགས་སོ། །སྨྲས་པ།
en: “Child of good family,” replied Nirārambha, “a conceptual designation is false and an imputation based on nothing.”

source: ཇི་ལྟར་ན་ཡང་དག་པ་མ་ཡིན་ཞིང་མེད་པ་ལས་སྒྲོ་བཏགས་པ་ཡིན། སྨྲས་པ། ནམ་འདི་ལྟར་བདག་ནི་ཆགས་པ། བདག་ནི་ཞེ་སྡང་བ། བདག་ནི་གཏི་མུག་པ།
en: “How is it false and an imputation based on nothing?”

source: བདག་ནི་ཉོན་མོངས་པ།
en: asked Mativikrama.

source: བདག་ནི་རྣམ་པར་དག་པ། བདག་ནི་བཅིངས་པ། བདག་ནི་གྲོལ་བ། བདག་ནི་འཁོར་བ། བདག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ་སྙམ་པ་ལ་སོགས་པར་སྒྲོ་བཏགས་པ་ཐམས་ཅད་ནི་ཡང་དག་པ་མ་ཡིན་ཞིང་མེད་པ་ལས་ཡོངས་སུ་བརྟགས་པའོ། །
en: Nirārambha replied, “All imputations, such as thinking ‘I am attached,’ ‘I am angry,’ ‘I am dull,’ ‘I am afflicted,’ ‘I am pure,’ ‘I am fettered,’ ‘I am free,’ ‘I am in saṃsāra,’ ‘I have passed into nirvāṇa,’ and similar thoughts are false and are conceptual designations based on nothing.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་དག་ཐམས་ཅད་ནི་རྒྱུ་དང་རྐྱེན་ཙམ་སྟེ།
en: How so?

source: འདི་ལ་བདག་དང་བདག་གི་མེད། སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད། ཤེད་ལས་སྐྱེས་མེད།
en: They are all circumstantial; there is no ‘I’ or ‘mine,’ no being, no life force, no person, no human being, no humankind.

source: ཤེད་བུ་མེད་དོ། །རྒྱུ་དང་རྐྱེན་དེ་དག་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པ།
en: They are all circumstantial, and naturally empty.

source: རང་བཞིན་གྱིས་དབེན་པ། སེམས་དང་ཡིད་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་བྲལ་བ། མི་སེམས་པ།
en: They are naturally isolated and free of mind, thought, and the mental consciousness.

source: ཡོངས་སུ་མི་རྟོག་པ།
en: They are not sentient but are conceptual designations.

source: ཀུན་ནས་ཉོན་མོངས་པ་མ་ཡིན་པ། རྣམ་པར་བྱང་བ་མ་ཡིན་པ། འཁོར་བ་མ་ཡིན་པ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མ་ཡིན་པའོ། །
en: They are not afflicted or pure and are not related to saṃsāra or nirvāṇa.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡོད་པ་མ་ཡིན་པ་ལ་སྒྲོ་མི་འདོགས་ཤིང་།
en: Bodhisattvas do not form imputations on what does not exist.

source: དེ་སྒྲོ་འདོགས་པ་བཏང་བས་གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་ཞེས་བྱའོ། །
en: Giving up imputations is known as perfect giving.

source: ནམ་ཆོས་དེ་དག་རྗེས་སུ་དྲན་པ་དེ་ནི་དེའི་གཏོང་བ་རྗེས་སུ་དྲན་པ་ཞེས་བྱའོ། །
en: When bodhisattvas recollect this quality, it is known as the recollection of giving.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཏོང་བ་རྣམ་པ་གསུམ་སྟེ། གཏོང་བ་དང་གཏོང་བ་ཆེན་པོ་དང་། ཤིན་ཏུ་གཏོང་བའོ། །
en: “Furthermore, child of good family, a bodhisattva’s practice of giving is of three types: giving, great giving, the supreme giving.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཏོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བཟའ་བ་འདོད་པ་རྣམས་ལ་བཟའ་བ་སྦྱིན་པ་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་།
en: What is the bodhisattvas’ practice of giving?

source: གོས་དང་། མར་མེ་དང་། བདུག་སྤོས་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: It is the giving of food to those who need food, and the giving of drink, conveyances, clothes, lamps, incense, fragrances, garlands, ointments, powders, cloth, parasols, banners, flags, chariots, ornaments, and so forth.

source: བ་དན་དང་། ཤིང་རྟ་དང་རྒྱན་ལ་སོགས་པ་སྦྱིན་པ་སྟེ། སྦྱིན་པ་གང་སེམས་ཅན་རྣམས་ལ་གནོད་པ་དང་། ཕོངས་པར་འགྱུར་བ་དེ་མ་གཏོགས་པར་བྱང་ཆུབ་སེམས་དཔའ་དག་སེམས་ཅན་རྣམས་ལ་མི་སྦྱིན་པ་གང་ཡང་མེད་དེ།
en: There is no object bodhisattvas do not give to beings apart from that which would harm or ruin them.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཏོང་བ་ཞེས་བྱའོ། །
en: This is known as the bodhisattvas’ practice of giving.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཏོང་བ་ཆེན་པོ་གང་ཞེ་ན།
en: “What is the bodhisattvas’ practice of great giving?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཏོང་བ་ཕུན་སུམ་ཚོགས་ནས་གཏོང་བ་ཆེན་པོ་བྱེད་དེ། འདི་ལྟ་སྟེ་ཆུང་མ་དང་།
en: Bodhisattvas engage in great giving after they perfect giving.

source: བུ་དང་། བུ་མོ་དང་། ཡིད་དུ་འོང་བའི་བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་།
en: They give up their wives, sons, daughters, beloved male and female servants, workers, laborers, household, and kingdom.

source: ཞོ་ཤས་འཚོ་བ་དང་། ཁྱིམ་དང་། རྒྱལ་སྲིད་རྣམས་ཡོངས་སུ་གཏོང་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་གཏོང་བ་ཆེན་པོ་ཞེས་བྱའོ། །
en: This is known as the bodhisattvas’ practice of great giving.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤིན་ཏུ་གཏོང་བ་གང་ཞེ་ན།
en: “What is the bodhisattvas’ practice of supreme giving?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཏོང་བ་དང་གཏོང་བ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་ནས་ཤིན་ཏུ་གཏོང་བ་བྱེད་དེ། འདི་ལྟ་སྟེ། ལག་པ་དང་། རྐང་པ་དང་། རྣ་བ་དང་། སྣ་དང་། ཤ་དང་། རུས་པ་དང་།
en: Bodhisattvas engage in supreme giving after they perfect giving and great giving.

source: པགས་པ་དང་། མིག་དང་། ལྕེ་དང་། མགོ་རུས་དང་། རྐང་ལ་སོགས་པ་ཡོངས་སུ་གཏོང་བ་སྟེ།
en: It entails giving up their arms, legs, ears, nose, flesh, bones, skin, eyes, tongue, skull, marrow, and so forth.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤིན་ཏུ་གཏོང་བ་ཞེས་བྱའོ། །
en: This is known as the bodhisattvas’ practice of supreme giving.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེས་གཏོང་བ་དང་། གཏོང་བ་ཆེན་པོ་དང་ཤིན་ཏུ་གཏོང་བ་དེ་དག་རྗེས་སུ་དྲན་ནས། བདག་གིས་ཀྱང་དྲན་པ་དེ་དག་ཡོངས་སུ་རྫོགས་པར་བྱའོ་སྙམ་པ་དེ་ནི་དེའི་གཏོང་བ་རྗེས་སུ་དྲན་པ་ཞེས་བྱ་སྟེ།
en: “A bodhisattva recollects giving, great giving, and supreme giving, and thinks, ‘I will perfect these kinds of mindfulness.’

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་གཏོང་བ་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: That is known as the recollection of giving, and this, in total, is known as a bodhisattva’s application of the mindfulness of recollecting giving.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷ་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s application of the mindfulness of recollecting divinities?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་རྣམ་པར་དག་པའི་ལྷ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་རྗེས་སུ་དྲན་ནོ། །
en: It is a bodhisattva’s recollection of the pure divinities: śrāvakas, pratyekabuddhas, bodhisattvas, and completely perfect buddhas.

source: འདི་ལྟར་དེ་དག་རྗེས་སུ་དྲན་ཏེ། བསྒྲུབ་པ་དང་ཡོན་ཏན་དང་། སྐྱེ་བ་དང་ལོངས་སྤྱོད་དང་། ཀུན་དཔྱོད་པ་དང་། རྩོམ་པ་དང་།
en: Bodhisattvas recollect them through their practices, good qualities, birth, pleasures, behavior, endeavors, attainments, and accomplishment.

source: རབ་ཏུ་འཐོབ་པ་དང་། ཡོངས་སུ་འགྲུབ་པས་ཀྱང་རྗེས་སུ་དྲན་པ་འདི་ནི་ལྷ་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: This is known as the application of the mindfulness of recollecting divinities.

source: གང་ལྷ་གཞན་དེ་དག་ཀྱང་རྗེས་སུ་དྲན་ནོ། །
en: “Bodhisattvas also recollect other divinities.

source: འདི་ལྟར་དེ་དག་རྗེས་སུ་དྲན་ཏེ་ལྷ་འདི་དག་ནི་ལས་དགེ་བའི་འབྲས་བུ་ལས་བྱུང་བའོ། །དགེ་བའི་ལས་དེ་དག་ནི་འདི་ལྟ་སྟེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་མི་དགེ་བ་ལས་བཟློག་པ་རྣམས་སོ། །དེ་ལས་ལྷ་གང་རྣམས་ཁ་དོག་དང་ལྡན་པ།
en: They think, ‘In a similar way to how I recollected those divinities, these divinities are the products of virtuous actions—virtuous actions that include the path of the ten virtuous actions that counter nonvirtue.

source: བདེ་བ་མང་བ། དབང་པོ་ཚིམ་པ། དེ་དག་ཐམས་ཅད་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་རྣམ་པར་སྨིན་པའོ་སྙམ་སྟེ།
en: All their appearances, many states of bliss, and sensory gratifications are the ripening of the path of the ten virtuous deeds.’

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་བདེ་བ་དེ་ལ་རྗེས་སུ་ཡི་རང་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ། །
en: Bodhisattvas will then rejoice in that divine bliss, and dedicate themselves to unsurpassable, completely perfect awakening for the benefit of all beings.

source: ལྷའི་བདེ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱིར་འདོད་དོ། །བདེ་བ་དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱིར་འདོད་པས་དགེ་བའི་རྩ་བ་ཡོངས་སུ་གྲུབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཆེན་པོ་རྩོམ་མོ། །
en: They wish that all beings would have divine bliss, and through the wish that all beings have that divine bliss, then establish the great diligence required to accomplish the roots of virtue.

source: ངན་སོང་རྣམས་སུ་སྐྱེས་པའི་སེམས་ཅན་དག་ལ་སྙིང་རྗེ་ཆེན་པོ་རྙེད་དེ། དེ་འདི་སྙམ་དུ་བདག་གིས་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ལྷའི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་བའི་ལས་བྱེད་དུ་གཟུད་དོ། །
en: “Bodhisattvas discover great compassion for beings born in the lower realms and think, ‘I will orient all such beings toward the performance of actions that lead to birth among the worldly gods.

source: སེམས་ཅན་གང་དག་ལྷར་གྱུར་པ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ། །
en: For those beings already among the gods, I will work for their full and complete attainment of unsurpassable, completely perfect awakening.

source: གང་གིས་སེམས་ཅན་རྣམས་ལྷའི་བདེ་བ་ཐོབ་ནས་ཕྱིས་ཉམས་པར་མི་འགྱུར་བ་དང་། བདེ་བར་གྱུར་ནས་འདི་ལྟ་སྟེ།
en: I will ensure that beings perform those actions through which they attain divine bliss, that it does not later diminish, and that once they have reached that bliss, they attain the bliss of the thus-gone ones’ peaceful bliss.’

source: དེ་བཞིན་གཤེགས་པའི་ཉེ་བར་ཞི་བའི་བདེ་བའི་བདེ་བ་ཐོབ་པར་འགྱུར་བའི་ལས་དེ་དག་སེམས་ཅན་རྣམས་བྱེད་དུ་གཞུག་གོ་སྙམ་དུ་སེམས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷ་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱ་སྟེ།
en: This thought is known as a bodhisattva’s application of the mindfulness of recollecting divinities.

source: རིགས་ཀྱི་བུ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པ་ཉེ་བར་གཞག་པ་བཅུའོ། །
en: “Child of good family, these are a bodhisattva’s ten applications of mindfulness.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ཀྱིས་དེའི་ཚེ་དོན་དེ་ཉིད་ཚིགས་སུ་བཅད་པ་དག་གིས་སྨྲས་པ། གང་ཕྱིར་སྡུག་བསྔལ་མ་གཏོགས་པར། །སྟོང་པ་ཉིད་ནི་མི་དམིགས་པས། །སྡུག་བསྔལ་སྡུག་བསྔལ་མི་ལྟ་སྟེ། །སྡུག་བསྔལ་སྟོང་པར་བལྟ་བར་བྱ། །
en: The bodhisattva great being Nirārambha then expressed that same meaning in verse: “Because emptiness is not observed Anywhere other than suffering, Do not see suffering as suffering; Suffering should be seen as empty.

source: སྟོང་པ་ཉིད་ནི་ལྟ་འདོད་པས། །སྡུག་བསྔལ་ཡང་དག་བལྟ་བར་བྱ། །
en: “One who wishes to see emptiness Should see suffering correctly.

source: སྡུག་བསྔལ་སྟོང་པ་ཉིད་ཀྱི་དོན། །སྟོང་པ་དེ་ནི་འདུས་མ་བྱས། །
en: Suffering is the meaning of emptiness, As that which is empty is uncompounded.

source: སྡུག་བསྔལ་བྱས་པ་མ་ཡིན་པས། །སྡུག་བསྔལ་ལ་ནི་བྱེད་པ་མེད། །
en: “Because suffering is uncreated, Suffering has no creator.

source: སྡུག་བསྔལ་བྲལ་བའི་བྱེད་པ་པོ། །མ་བྱུང་འབྱུང་བར་མི་འགྱུར་རོ། །
en: A creator that is free of suffering Never was and never will be.

source: གལ་ཏེ་སྡུག་བསྔལ་ཡང་དག་ཏུ། །ཀུན་ནས་སྒྲིབ་པ་མེད་གྱུར་ཏེ། །གལ་ཏེ་སྡུག་བསྔལ་བྱས་མིན་ན། །འདི་ལ་ཀུན་འབྱུང་ག་ལ་ཡོད། །
en: “If suffering is totally and completely Free of any obscuration, And if suffering is uncreated, What then is its origin?

source: སྡུག་བསྔལ་ལ་ནི་འོང་མེད་དེ། །གང་དུ་ཡང་ནི་འགྲོ་མིན་ན། །གང་གིས་དེ་ཡི་ཆགས་འབྱུང་བ། །
en: “If suffering does not involve coming, And it does not go anywhere, How does attachment arise?

source: སྡུག་བསྔལ་མེད་ན་ག་ལ་ཡོད། །
en: If suffering does not exist, where is it?

source: གལ་ཏེ་སྡུག་བསྔལ་ཀུན་འབྱུང་སྟེ། །སྲེད་པ་ཀུན་འབྱུང་བཤད་ན་ནི། །སྲེད་ཅན་སྲེད་ཡོད་མ་ཡིན་ན། །མེད་ན་ཀུན་འབྱུང་ཇི་ལྟར་འགྱུར། །
en: “If suffering has an origin, And craving is explained as that origin, But there is no one who craves and no craving, How then could there be a source?

source: སྡུག་བསྔལ་ལ་ནི་འོང་མེད་དེ། །
en: “Suffering does not involve coming.

source: འོང་བ་མེད་ན་ཅི་ཞིག་འགྲོ། །
en: Without coming, how could there be going?

source: འོང་དང་འགྲོ་བ་མེད་པར་ནི། །འགོག་པ་ཞི་བ་ཞེས་བསྟན་ཏོ། །
en: In the absence of coming and going, Cessation is taught to be peace.

source: ཆོས་རྣམས་ངོ་བོ་ཉིད་ཀྱིས་ཞི། །རྩ་བ་དག་ཅིང་འོད་ཀྱང་གསལ། །
en: “Phenomena are essentially peaceful; Their root is pure, luminous, and clear.

source: འགོག་པོ་དང་ནི་ཆོས་རྣམས་མཚུངས། །ཐམས་ཅད་མཐའ་གཉིས་རབ་ཏུ་སྤངས། །
en: Cessation and phenomena are equivalent; All things relinquish the two extremes.

source: སྔོན་དུ་སྐྱེས་པའི་ཆོས་རྣམས་ཀྱང་། །དེ་མ་ཐག་ཏུ་འགག་པར་འགྱུར། །
en: “Phenomena that previously arose Will also immediately cease.

source: འགག་པ་མེད་པར་སྐྱེ་བ་མེད། །སྐྱེ་བ་མེད་པར་ཟད་པ་མེད། །
en: Without cessation there is no arising, And without arising, no waning.

source: དེ་ལྟར་གང་གི་བློ་ཚོལ་བ། །དེ་ནི་ཆགས་མེད་ཟད་མེད་ལམ། །
en: “The effort to conceive of that Is the path of nonattachment and nonwaning.

source: ལམ་ནི་གཟིངས་དང་འདྲ་བར་བསྟན། །མདོར་ན་གཟིངས་ནི་སྤང་བར་བྱ། །
en: The path is taught to be like a boat, A boat that should be entirely given up.

source: གང་བསགས་སྤང་བར་བྱ་བ་ཡི། །ཆོས་དེ་ལ་ནི་ཅི་ཞིག་དགའ། །
en: “What joy can be found in a phenomenon That is gathered, only to be given up?

source: ལམ་སྤངས་ཐང་ལ་གནས་པ་དེ། །རྣལ་འབྱོར་པ་ནི་གྲོལ་ཞེས་བརྗོད། །
en: The yogi is called free Who keeps to the high ground of giving up the path.

source: དེས་ནི་ལམ་གྱི་ཡེ་ཤེས་ཀྱིས། །གང་ཕྱིར་ཆོས་ཀུན་བསྒོམས་པས་ན། །གྲོལ་བའི་མཚན་ཉིད་རབ་བསྟན་པ། །
en: “Thus, by meditating on phenomena Using the wisdom of the path, The qualities of liberation are revealed.

source: དེ་ནི་གང་དུའང་རྩོད་པ་མེད། །
en: This is wholly indisputable.

source: སྐྲ་དང་བ་སྤུ་སེན་མོ་སོ། །ཤ་དང་རུས་པ་ཁྲག་དང་ཞག །ཚིལ་དང་ཤས་རྒྱས་ཕྱི་ས་དང་། །མཁྲིས་པ་བད་ཀན་ཀླད་པ་དང་། །མཚེར་པ་རྒྱུས་པ་གཉེ་མ་དང་། །
en: “What we call the body Is a mass of head hair, body hair, Nails, teeth, flesh, bone, blood, Fat, omentum, muscle, excrement, “Bile, phlegm, brain, Liver, tendons, intestines, and urine.

source: གཅིན་གྱི་ཕུང་པོ་ལུས་ཞེས་བརྗོད། །རྣལ་འབྱོར་པས་ནི་ལུས་རྣམས་ལ། །ཡོད་མིན་ཀུན་བརྟགས་ཙམ་དུ་མཐོང་། །
en: The yogi sees these body parts As mere nonexistent imaginings.

source: འདི་ལ་བྱེད་དང་ཚོར་བ་དང་། །མཐོང་བ་པོ་ནི་གང་ཡང་མེད། །
en: “In it there is no actor, No one who senses or sees.

source: ལུས་ཞེས་བྱ་བར་རང་བཞིན་གྱིས། །གྲོང་སྟོང་དང་ནི་འདྲ་བའོ། །
en: What we call the ‘body’ Is inherently like an empty town.

source: ཚོར་བ་མྱོང་བར་རབ་བསྟན་པ། །
en: “Sensation is described as ‘experience,’ But who experiences it?

source: ཚོར་བ་པོ་ལས་ཚོར་བ་གཞན། །གུད་ན་ཡོད་པ་མ་ཡིན་ན། །གང་གིས་དེ་ནི་མྱོང་བར་འགྱུར། །
en: There is no one to sense it Who is separate from the sensation.

source: བྱང་ཆུབ་ཅི་འདྲ་དེ་བཞིན་དུ། །ཞི་ཞིང་དག་ལ་འོད་གསལ་བར། །ཚོར་བ་འདི་ལ་མཁས་རྣམས་ཀྱིས། །དྲན་པ་དེ་ལ་ཉེ་བར་གཞག །
en: “This is how the astute Apply mindfulness to sensation. It is peaceful, pure, and luminous, Just as awakening is.

source: ལུས་ལས་སེམས་ནི་མི་མཐོང་སྟེ། །སེམས་ལ་ཡང་ནི་སེམས་དེ་བཞིན། །
en: “Mind is not seen in the body, Nor likewise the mind in the mind.

source: དེ་ལྟར་ཤེས་ནས་འཁྲུག་པ་མེད། །གྲོལ་བ་པོ་ནི་དགའ་བའང་མེད། །
en: Knowing this, there is no agitation; Even the one who liberates knows no joy.

source: སེམས་ཙམ་དུ་ནི་རབ་མཐོང་སྟེ། །
en: “One sees merely the mind.
